-- =====================
-- CATEGORIES
-- =====================
INSERT INTO categories (id, name) VALUES
(1, 'здоровье'),
(2, 'обучение'),
(3, 'продуктивность'),
(4, 'ментальное состояние'),
(5, 'личная жизнь');


-- =====================
-- DIMENSIONS
-- =====================
INSERT INTO dimensions (id, name, category_id) VALUES
-- time_of_day
(1, 'утро', NULL),
(2, 'день', NULL),
(3, 'вечер', NULL),

-- activity_type
(4, 'физическая', NULL),
(5, 'когнитивная', NULL),
(6, 'социальная', NULL),

-- context
(7, 'дома', NULL),
(8, 'вне дома', NULL),

-- difficulty
(9, 'легкая', NULL),
(10, 'средняя', NULL),
(11, 'сложная', NULL),

-- tracking_type
(12, 'бинарная', NULL),
(13, 'количественная', NULL);


-- =====================
-- TAGS
-- =====================
INSERT INTO tags (id, name, dimension_id, category_id) VALUES

-- здоровье
(1, 'бег', NULL, 1),
(2, 'тренировка', NULL, 1),
(3, 'растяжка', NULL, 1),
(4, 'прогулка', NULL, 1),
(5, 'сон', NULL, 1),
(6, 'питание', NULL, 1),

-- обучение
(7, 'чтение', NULL, 2),
(8, 'изучение языка', NULL, 2),
(9, 'онлайн-курс', NULL, 2),
(10, 'кодинг', NULL, 2),

-- продуктивность
(11, 'планирование', NULL, 3),
(12, 'deep work', NULL, 3),
(13, 'работа', NULL, 3),
(14, 'разбор почты', NULL, 3),

-- ментальное
(15, 'медитация', NULL, 4),
(16, 'дневник', NULL, 4),
(17, 'рефлексия', NULL, 4),
(18, 'отдых', NULL, 4),

-- личная жизнь
(19, 'семья', NULL, 5),
(20, 'друзья', NULL, 5),
(21, 'хобби', NULL, 5);